"""
/step/2
локальная переменная

/step/3
область действия

/step/4
UnboundLocalError: local variable 's' referenced before assignment

/step/5
да

/step/6
I love Paris
I love London
I love Moscow

/step/7
1

/step/8
num
i
flag

/step/10
глобальной переменной

/step/11
глобальных переменных

/step/12
8
5

/step/13
8
8

/step/14
глобальные переменные доступны для всех функций
функция вызывается по своему имени с указанием необходимых аргументов
локальные переменные, определенные в пределах функции, действуют только в ней
после выхода из функции локальные переменные станут недоступны
"""
